app/controllers/analysis_controller.rb

  def question_2
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def question_2_1
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]

  def question_3
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

  def question_4
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]

  def question_5
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 51], ["LIMIT", 1]]

  def question_6
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 51], ["LIMIT", 1]]

  def create_1
    @user = User.new(
      name: params[:name]
    )
    @user.save
    @personal = Personal.new(point5: @user.id)
    @personal.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "地雷将棋"], ["created_at", "2019-05-09 10:12:45.180472"], ["updated_at", "2019-05-09 10:12:45.180472"]]
INSERT INTO "personals" ("point5", "created_at", "updated_at") VALUES (?, ?, ?)  [["point5", 52.0], ["created_at", "2019-06-12 13:35:45.515064"], ["updated_at", "2019-06-12 13:35:45.515064"]]

  def create_2
    @user = User.find_by(id: params[:id])
    @user.age = params[:age]
    @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "users" SET "age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", "21歳"], ["updated_at", "2019-05-09 10:27:08.378630"], ["id", 14]]

  def create_2_1
    @user = User.find_by(id: params[:id])
    @user.sex = params[:sex]
    @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]
UPDATE "users" SET "sex" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["sex", "female"], ["updated_at", "2019-07-24 05:35:08.109936"], ["id", 68]]

  def create_3
    @user = User.find_by(id: params[:id])
    @personal = Personal.find_by(point5: @user.id)
    @personal.point1 = params[:check].to_i
    @personal.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
SELECT  "personals".* FROM "personals" WHERE "personals"."point5" = ? LIMIT ?  [["point5", 52.0], ["LIMIT", 1]]
UPDATE "personals" SET "point1" = ?, "updated_at" = ? WHERE "personals"."id" = ?  [["point1", -1.0], ["updated_at", "2019-06-12 12:24:40.644344"], ["id", 46]]

  def create_4
    @user = User.find_by(id: params[:id])
    @personal = Personal.find_by(id: params[:id])
    @personal.point2 = params[:check].to_i
    @personal.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]
SELECT  "personals".* FROM "personals" WHERE "personals"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]
UPDATE "personals" SET "point2" = ?, "updated_at" = ? WHERE "personals"."id" = ?  [["point2", -1.0], ["updated_at", "2019-06-12 12:37:18.679813"], ["id", 46]]

  def create_5
    @user = User.find_by(id: params[:id])
    @personal = Personal.find_by(point5: @user.id)
    @personal.point3 = params[:check].to_i
    @personal.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 51], ["LIMIT", 1]]
SELECT  "personals".* FROM "personals" WHERE "personals"."point5" = ? LIMIT ?  [["point5", 52.0], ["LIMIT", 1]]
UPDATE "personals" SET "point3" = ?, "updated_at" = ? WHERE "personals"."id" = ?  [["point3", -1.0], ["updated_at", "2019-06-12 13:24:48.385253"], ["id", 51]]

  def result
    @user = User.find_by(id: params[:id])
    @personal = Personal.find_by(point5: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT  "personals".* FROM "personals" WHERE "personals"."point5" = ? LIMIT ?  [["point5", 69.0], ["LIMIT", 1]]