app/controllers/home_controller.rb

  def top
    @users = User.all
---
SELECT "users".* FROM "users"